
# State **`s3://infrahouse-website-infra/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |       16 |           4 |           16 |
## Affected resources by action

|  Action  | Resources                                                                        |
|:--------:|:---------------------------------------------------------------------------------|
|    🟢    | `module.website.random_string.profile_suffix`                                    |
|    🟢    | `module.website.module.instance_profile.aws_iam_instance_profile.profile`        |
|    🟢    | `module.website.module.instance_profile.aws_iam_policy.profile`                  |
|    🟢    | `module.website.module.instance_profile.aws_iam_role.profile`                    |
|    🟢    | `module.website.module.instance_profile.aws_iam_role_policy_attachment.profile`  |
|    🟡    | `module.website.aws_alb.website`                                                 |
|    🟡    | `module.website.aws_autoscaling_group.website`                                   |
|    🟡    | `module.website.aws_launch_template.website`                                     |
|    🟡    | `module.website.aws_lb_listener.ssl`                                             |
|    🔴    | `module.website.aws_vpc_security_group_ingress_rule.backend_ssh_input[0]`        |
|    🔴    | `module.website.module.webserver_profile.aws_iam_instance_profile.profile`       |
|    🔴    | `module.website.module.webserver_profile.aws_iam_policy.profile`                 |
|    🔴    | `module.website.module.webserver_profile.aws_iam_role.profile`                   |
|    🔴    | `module.website.module.webserver_profile.aws_iam_role_policy_attachment.profile` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.website.aws_alb.website will be updated in-place
  ~ resource "aws_alb" "website" {
        id                                                           = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/web20230818170821317100000008/03a64b8fc9f0f055"
        name                                                         = "web20230818170821317100000008"
      ~ security_groups                                              = [
          - "sg-0799a67df58426525",
        ] -> (known after apply)
      ~ subnets                                                      = [
          - "subnet-05fa33164c768ab65",
          - "subnet-086ccf1b7842243d2",
          + "subnet-04b8845d896c6ebde",
          + "subnet-0df885dcc99418799",
        ]
      ~ tags                                                         = {
          + "account"     = "493370826424"
          + "environment" = "production"
          + "managed-by"  = "terraform"
          + "service"     = "website"
        }
      ~ tags_all                                                     = {
          + "account"     = "493370826424"
          + "managed-by"  = "terraform"
          + "service"     = "website"
            # (2 unchanged elements hidden)
        }
        # (23 unchanged attributes hidden)

      ~ subnet_mapping {
          + arn                                                          = (known after apply)
          + arn_suffix                                                   = (known after apply)
          + client_keep_alive                                            = (known after apply)
          + customer_owned_ipv4_pool                                     = (known after apply)
          + desync_mitigation_mode                                       = (known after apply)
          + dns_name                                                     = (known after apply)
          + dns_record_client_routing_policy                             = (known after apply)
          + drop_invalid_header_fields                                   = (known after apply)
          + enable_cross_zone_load_balancing                             = (known after apply)
          + enable_deletion_protection                                   = (known after apply)
          + enable_http2                                                 = (known after apply)
          + enable_tls_version_and_cipher_suite_headers                  = (known after apply)
          + enable_waf_fail_open                                         = (known after apply)
          + enable_xff_client_port                                       = (known after apply)
          + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
          + id                                                           = (known after apply)
          + idle_timeout                                                 = (known after apply)
          + internal                                                     = (known after apply)
          + ip_address_type                                              = (known after apply)
          + load_balancer_type                                           = (known after apply)
          + name                                                         = (known after apply)
          + name_prefix                                                  = (known after apply)
          + preserve_host_header                                         = (known after apply)
          + security_groups                                              = (known after apply)
          + subnets                                                      = (known after apply)
          + tags                                                         = (known after apply)
          + tags_all                                                     = (known after apply)
          + vpc_id                                                       = (known after apply)
          + xff_header_processing_mode                                   = (known after apply)
          + zone_id                                                      = (known after apply)
        } -> (known after apply)

        # (2 unchanged blocks hidden)
    }

  # module.website.aws_alb_target_group.website must be replaced
+/- resource "aws_alb_target_group" "website" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20231207162208215500000001/5cd6505e39abdb2b" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/tf-20231207162208215500000001/5cd6505e39abdb2b" -> (known after apply)
      ~ connection_termination             = false -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20231207162208215500000001/5cd6505e39abdb2b" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/web20230818170821317100000008/03a64b8fc9f0f055",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
      ~ name                               = "tf-20231207162208215500000001" -> (known after apply)
      ~ name_prefix                        = "tf-" -> (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ vpc_id                             = "vpc-0ae798f941be45345" -> "vpc-08e19d859c26d18b2" # forces replacement
        # (8 unchanged attributes hidden)

      ~ target_failover {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

      ~ target_group_health {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

      ~ target_health_state {
          + arn                                = (known after apply)
          + arn_suffix                         = (known after apply)
          + connection_termination             = (known after apply)
          + deregistration_delay               = (known after apply)
          + id                                 = (known after apply)
          + ip_address_type                    = (known after apply)
          + lambda_multi_value_headers_enabled = (known after apply)
          + load_balancer_arns                 = (known after apply)
          + load_balancing_algorithm_type      = (known after apply)
          + load_balancing_anomaly_mitigation  = (known after apply)
          + load_balancing_cross_zone_enabled  = (known after apply)
          + name                               = (known after apply)
          + name_prefix                        = (known after apply)
          + port                               = (known after apply)
          + preserve_client_ip                 = (known after apply)
          + protocol                           = (known after apply)
          + protocol_version                   = (known after apply)
          + proxy_protocol_v2                  = (known after apply)
          + slow_start                         = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + target_type                        = (known after apply)
          + vpc_id                             = (known after apply)
        } -> (known after apply)

        # (2 unchanged blocks hidden)
    }

  # module.website.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
      ~ health_check_grace_period        = 300 -> 600
        id                               = "web20231125205239428700000003"
        name                             = "web20231125205239428700000003"
      ~ target_group_arns                = [
          - "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20231207162208215500000001/5cd6505e39abdb2b",
        ] -> (known after apply)
      ~ vpc_zone_identifier              = [
          - "subnet-01306fa9e14f9c980",
          - "subnet-06f352185ffc3fcd3",
          + "subnet-06caf71c8b0afd909",
          + "subnet-0f91dd2675e7a16c3",
        ]
        # (29 unchanged attributes hidden)

      + instance_maintenance_policy {
          + max_healthy_percentage = 200
          + min_healthy_percentage = 100
        }

      ~ launch_template {
            id      = "lt-042ea5dd55b0fff3b"
            name    = "web20231125205151213200000001"
          ~ version = "6" -> (known after apply)
        }

      + tag {
          + key                 = "created_by_module"
          + propagate_at_launch = true
          + value               = "infrahouse/website-pod/aws"
        }

        # (7 unchanged blocks hidden)
    }

  # module.website.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                                   = "lt-042ea5dd55b0fff3b"
      ~ latest_version                       = 6 -> (known after apply)
        name                                 = "web20231125205151213200000001"
        tags                                 = {}
      ~ user_data                            = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKInBhY2thZ2VfdXBkYXRlIjogdHJ1ZQoicGFja2FnZXMiOgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgotICJpbmZyYWhvdXNlLXB1cHBldC1kYXRhIgoicHVwcGV0IjoKICAiY29sbGVjdGlvbiI6ICJwdXBwZXQ4IgogICJpbnN0YWxsIjogdHJ1ZQogICJpbnN0YWxsX3R5cGUiOiAiYWlvIgogICJwYWNrYWdlX25hbWUiOiAicHVwcGV0LWFnZW50IgogICJzdGFydF9zZXJ2aWNlIjogZmFsc2UKInJ1bmNtZCI6Ci0gImloLXB1cHBldCAgLS1lbnZpcm9ubWVudCBwcm9kdWN0aW9uIC0tZW52aXJvbm1lbnRwYXRoIHtyb290X2RpcmVjdG9yeX0vZW52aXJvbm1lbnRzCiAgLS1yb290LWRpcmVjdG9yeSAvb3B0L3B1cHBldC1jb2RlIC0taGllcmEtY29uZmlnIC9vcHQvaW5mcmFob3VzZS1wdXBwZXQtZGF0YS9lbnZpcm9ubWVudHMvcHJvZHVjdGlvbi9oaWVyYS55YW1sCiAgLS1tb2R1bGUtcGF0aCB7cm9vdF9kaXJlY3Rvcnl9L21vZHVsZXMgYXBwbHkgL29wdC9wdXBwZXQtY29kZS9lbnZpcm9ubWVudHMvcHJvZHVjdGlvbi9tYW5pZmVzdHMvc2l0ZS5wcCIKIndyaXRlX2ZpbGVzIjoKLSAiY29udGVudCI6ICJleHBvcnQgQVdTX0RFRkFVTFRfUkVHSU9OPXVzLXdlc3QtMSIKICAicGF0aCI6ICIvZXRjL3Byb2ZpbGUuZC9hd3Muc2giCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiB8LQogICAgW2RlZmF1bHRdCiAgICByZWdpb249dXMtd2VzdC0xCiAgInBhdGgiOiAiL3Jvb3QvLmF3cy9jb25maWciCiAgInBlcm1pc3Npb25zIjogIjA2MDAiCi0gImNvbnRlbnQiOiB8CiAgICAicHVwcGV0X2Vudmlyb25tZW50IjogInByb2R1Y3Rpb24iCiAgICAicHVwcGV0X3JvbGUiOiAid2Vic2VydmVyIgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9wdXBwZXQueWFtbCIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6ICJ7XCJpaC1wdXBwZXRcIjp7XCJkZWJ1Z1wiOmZhbHNlLFwiZW52aXJvbm1lbnRwYXRoXCI6XCJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50c1wiLFwiaGllcmEtY29uZmlnXCI6XCIvb3B0L2luZnJhaG91c2UtcHVwcGV0LWRhdGEvZW52aXJvbm1lbnRzL3Byb2R1Y3Rpb24vaGllcmEueWFtbFwiLFwibWFuaWZlc3RcIjpcIi9vcHQvcHVwcGV0LWNvZGUvZW52aXJvbm1lbnRzL3Byb2R1Y3Rpb24vbWFuaWZlc3RzL3NpdGUucHBcIixcIm1vZHVsZS1wYXRoXCI6XCJ7cm9vdF9kaXJlY3Rvcnl9L21vZHVsZXNcIixcInJvb3QtZGlyZWN0b3J5XCI6XCIvb3B0L3B1cHBldC1jb2RlXCJ9fSIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvaWgtcHVwcGV0Lmpzb24iCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiAie30iCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL2N1c3RvbS5qc29uIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgoNCi0tTUlNRUJPVU5EQVJZLS0NCg==" -> "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKInBhY2thZ2VfdXBkYXRlIjogdHJ1ZQoicGFja2FnZXMiOgotICJtYWtlIgotICJnY2MiCi0gInB1cHBldC1jb2RlIgotICJpbmZyYWhvdXNlLXRvb2xraXQiCi0gImluZnJhaG91c2UtcHVwcGV0LWRhdGEiCiJwdXBwZXQiOgogICJjb2xsZWN0aW9uIjogInB1cHBldDgiCiAgImluc3RhbGwiOiB0cnVlCiAgImluc3RhbGxfdHlwZSI6ICJhaW8iCiAgInBhY2thZ2VfbmFtZSI6ICJwdXBwZXQtYWdlbnQiCiAgInN0YXJ0X3NlcnZpY2UiOiBmYWxzZQoicnVuY21kIjoKLSAiL29wdC9wdXBwZXRsYWJzL3B1cHBldC9iaW4vZ2VtIGluc3RhbGwganNvbiIKLSAiL29wdC9wdXBwZXRsYWJzL3B1cHBldC9iaW4vZ2VtIGluc3RhbGwgYXdzLXNkay1jb3JlIgotICIvb3B0L3B1cHBldGxhYnMvcHVwcGV0L2Jpbi9nZW0gaW5zdGFsbCBhd3Mtc2RrLXNlY3JldHNtYW5hZ2VyIgotICJpaC1wdXBwZXQgIC0tZW52aXJvbm1lbnQgcHJvZHVjdGlvbiAtLWVudmlyb25tZW50cGF0aCB7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cwogIC0tcm9vdC1kaXJlY3RvcnkgL29wdC9wdXBwZXQtY29kZSAtLWhpZXJhLWNvbmZpZyAvb3B0L2luZnJhaG91c2UtcHVwcGV0LWRhdGEvZW52aXJvbm1lbnRzL3Byb2R1Y3Rpb24vaGllcmEueWFtbAogIC0tbW9kdWxlLXBhdGgge3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzIGFwcGx5IC9vcHQvcHVwcGV0LWNvZGUvZW52aXJvbm1lbnRzL3Byb2R1Y3Rpb24vbWFuaWZlc3RzL3NpdGUucHAiCiJ3cml0ZV9maWxlcyI6Ci0gImNvbnRlbnQiOiAiZXhwb3J0IEFXU19ERUZBVUxUX1JFR0lPTj11cy13ZXN0LTEiCiAgInBhdGgiOiAiL2V0Yy9wcm9maWxlLmQvYXdzLnNoIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogfC0KICAgIFtkZWZhdWx0XQogICAgcmVnaW9uPXVzLXdlc3QtMQogICJwYXRoIjogIi9yb290Ly5hd3MvY29uZmlnIgogICJwZXJtaXNzaW9ucyI6ICIwNjAwIgotICJjb250ZW50IjogfAogICAgInB1cHBldF9lbnZpcm9ubWVudCI6ICJwcm9kdWN0aW9uIgogICAgInB1cHBldF9yb2xlIjogIndlYnNlcnZlciIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvcHVwcGV0LnlhbWwiCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiAie1wiaWgtcHVwcGV0XCI6e1wiZGVidWdcIjpmYWxzZSxcImVudmlyb25tZW50cGF0aFwiOlwie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHNcIixcImhpZXJhLWNvbmZpZ1wiOlwiL29wdC9pbmZyYWhvdXNlLXB1cHBldC1kYXRhL2Vudmlyb25tZW50cy9wcm9kdWN0aW9uL2hpZXJhLnlhbWxcIixcIm1hbmlmZXN0XCI6XCIvb3B0L3B1cHBldC1jb2RlL2Vudmlyb25tZW50cy9wcm9kdWN0aW9uL21hbmlmZXN0cy9zaXRlLnBwXCIsXCJtb2R1bGUtcGF0aFwiOlwie3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzXCIsXCJyb290LWRpcmVjdG9yeVwiOlwiL29wdC9wdXBwZXQtY29kZVwifX0iCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL2loLXB1cHBldC5qc29uIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogInt9IgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9jdXN0b20uanNvbiIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKDQotLU1JTUVCT1VOREFSWS0tDQo="
      ~ vpc_security_group_ids               = [
          - "sg-001f2fbb56baf1e25",
        ] -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ iam_instance_profile {
          ~ arn  = "arn:aws:iam::493370826424:instance-profile/webserver" -> (known after apply)
            name = null
        }

        # (1 unchanged block hidden)
    }

  # module.website.aws_lb_listener.ssl will be updated in-place
  ~ resource "aws_lb_listener" "ssl" {
        id                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/b938cfdfa221ef4d"
        tags              = {}
        # (7 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20231207162208215500000001/5cd6505e39abdb2b" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.website.aws_security_group.alb must be replaced
-/+ resource "aws_security_group" "alb" {
      ~ arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group/sg-0799a67df58426525" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ id                     = "sg-0799a67df58426525" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all ICMP traffic"
              - from_port        = -1
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "icmp"
              - security_groups  = []
              - self             = false
              - to_port          = -1
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "User traffic to HTTPS port"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "User traffic to port 80"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> (known after apply)
      ~ name                   = "web-20240201192236534900000001" -> (known after apply)
      ~ owner_id               = "493370826424" -> (known after apply)
        tags                   = {
            "Name" = "website load balancer"
        }
      ~ vpc_id                 = "vpc-0ae798f941be45345" -> "vpc-08e19d859c26d18b2" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.website.aws_security_group.backend must be replaced
+/- resource "aws_security_group" "backend" {
      ~ arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group/sg-001f2fbb56baf1e25" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ id                     = "sg-001f2fbb56baf1e25" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all ICMP traffic"
              - from_port        = -1
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "icmp"
              - security_groups  = []
              - self             = false
              - to_port          = -1
            },
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/22",
                ]
              - description      = "SSH access from the service specified CIDR range"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "10.0.4.0/22",
                ]
              - description      = "SSH access from the service website VPC"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "10.0.4.0/22",
                ]
              - description      = "User traffic from the Load Balancer"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> (known after apply)
      ~ name                   = "web-20240201192236535100000002" -> (known after apply)
      ~ owner_id               = "493370826424" -> (known after apply)
        tags                   = {
            "Name" = "website backend"
        }
      ~ vpc_id                 = "vpc-0ae798f941be45345" -> "vpc-08e19d859c26d18b2" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.website.aws_vpc_security_group_egress_rule.alb_outgoing must be replaced
-/+ resource "aws_vpc_security_group_egress_rule" "alb_outgoing" {
      ~ arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0ab30dc7516a3ab9b" -> (known after apply)
      ~ id                     = "sgr-0ab30dc7516a3ab9b" -> (known after apply)
      ~ security_group_id      = "sg-0799a67df58426525" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0ab30dc7516a3ab9b" -> (known after apply)
        tags                   = {
            "Name" = "outgoing traffic"
        }
        # (3 unchanged attributes hidden)
    }

  # module.website.aws_vpc_security_group_egress_rule.backend_outgoing must be replaced
-/+ resource "aws_vpc_security_group_egress_rule" "backend_outgoing" {
      ~ arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-032ef2c4105c8787d" -> (known after apply)
      ~ id                     = "sgr-032ef2c4105c8787d" -> (known after apply)
      ~ security_group_id      = "sg-001f2fbb56baf1e25" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-032ef2c4105c8787d" -> (known after apply)
        tags                   = {
            "Name" = "outgoing traffic"
        }
        # (3 unchanged attributes hidden)
    }

  # module.website.aws_vpc_security_group_ingress_rule.alb_icmp must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "alb_icmp" {
      ~ arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-03f6ba101065f71ae" -> (known after apply)
      ~ id                     = "sgr-03f6ba101065f71ae" -> (known after apply)
      ~ security_group_id      = "sg-0799a67df58426525" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-03f6ba101065f71ae" -> (known after apply)
        tags                   = {
            "Name" = "ICMP traffic"
        }
        # (6 unchanged attributes hidden)
    }

  # module.website.aws_vpc_security_group_ingress_rule.alb_listener_port must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "alb_listener_port" {
      ~ arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-035d64471b6ebc8fe" -> (known after apply)
      ~ id                     = "sgr-035d64471b6ebc8fe" -> (known after apply)
      ~ security_group_id      = "sg-0799a67df58426525" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-035d64471b6ebc8fe" -> (known after apply)
        tags                   = {
            "Name" = "user traffic"
        }
        # (6 unchanged attributes hidden)
    }

  # module.website.aws_vpc_security_group_ingress_rule.backend_icmp must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "backend_icmp" {
      ~ arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0b3b513e90b3a6c6e" -> (known after apply)
      ~ id                     = "sgr-0b3b513e90b3a6c6e" -> (known after apply)
      ~ security_group_id      = "sg-001f2fbb56baf1e25" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0b3b513e90b3a6c6e" -> (known after apply)
        tags                   = {
            "Name" = "ICMP traffic"
        }
        # (6 unchanged attributes hidden)
    }

  # module.website.aws_vpc_security_group_ingress_rule.backend_ssh_input[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from module.website.aws_vpc_security_group_ingress_rule.backend_ssh_input)
  - resource "aws_vpc_security_group_ingress_rule" "backend_ssh_input" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-075c4f182ab27c870" -> null
      - cidr_ipv4              = "10.0.0.0/22" -> null
      - description            = "SSH access from the service specified CIDR range" -> null
      - from_port              = 22 -> null
      - id                     = "sgr-075c4f182ab27c870" -> null
      - ip_protocol            = "tcp" -> null
      - security_group_id      = "sg-001f2fbb56baf1e25" -> null
      - security_group_rule_id = "sgr-075c4f182ab27c870" -> null
      - tags                   = {
          - "Name" = "SSH additional"
        } -> null
      - tags_all               = {
          - "Name"        = "SSH additional"
          - "created_by"  = "infrahouse/infrahouse-website-infra"
          - "environment" = "production"
        } -> null
      - to_port                = 22 -> null
    }

  # module.website.aws_vpc_security_group_ingress_rule.backend_ssh_local must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "backend_ssh_local" {
      ~ arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-01a9bdc7877e27966" -> (known after apply)
      ~ cidr_ipv4              = "10.0.4.0/22" -> "10.0.0.0/22"
      ~ id                     = "sgr-01a9bdc7877e27966" -> (known after apply)
      ~ security_group_id      = "sg-001f2fbb56baf1e25" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-01a9bdc7877e27966" -> (known after apply)
        tags                   = {
            "Name" = "SSH local"
        }
        # (5 unchanged attributes hidden)
    }

  # module.website.aws_vpc_security_group_ingress_rule.backend_user_traffic must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "backend_user_traffic" {
      ~ arn                          = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-05a452eb8d5e0eb25" -> (known after apply)
      - cidr_ipv4                    = "10.0.4.0/22" -> null # forces replacement
      ~ description                  = "User traffic from the Load Balancer" -> "Any traffic from the Load Balancer"
      - from_port                    = 80 -> null
      ~ id                           = "sgr-05a452eb8d5e0eb25" -> (known after apply)
      ~ ip_protocol                  = "tcp" -> "-1"
      + referenced_security_group_id = (known after apply) # forces replacement
      ~ security_group_id            = "sg-001f2fbb56baf1e25" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-05a452eb8d5e0eb25" -> (known after apply)
      ~ tags                         = {
          ~ "Name" = "user traffic" -> "Load balancer traffic"
        }
      ~ tags_all                     = {
          ~ "Name"        = "user traffic" -> "Load balancer traffic"
            # (2 unchanged elements hidden)
        }
      - to_port                      = 80 -> null
    }

  # module.website.aws_vpc_security_group_ingress_rule.https must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "https" {
      ~ arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-019a6a2bd9be697ce" -> (known after apply)
      ~ id                     = "sgr-019a6a2bd9be697ce" -> (known after apply)
      ~ security_group_id      = "sg-0799a67df58426525" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-019a6a2bd9be697ce" -> (known after apply)
        tags                   = {
            "Name" = "https user traffic"
        }
        # (6 unchanged attributes hidden)
    }

  # module.website.random_string.profile_suffix will be created
  + resource "random_string" "profile_suffix" {
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.website.module.instance_profile.aws_iam_instance_profile.profile will be created
  + resource "aws_iam_instance_profile" "profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all    = {
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
      + unique_id   = (known after apply)
    }

  # module.website.module.instance_profile.aws_iam_policy.profile will be created
  + resource "aws_iam_policy" "profile" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:Describe*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
    }

  # module.website.module.instance_profile.aws_iam_role.profile will be created
  + resource "aws_iam_role" "profile" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.website.module.instance_profile.aws_iam_role_policy_attachment.profile will be created
  + resource "aws_iam_role_policy_attachment" "profile" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.website.module.webserver_profile.aws_iam_instance_profile.profile will be destroyed
  # (because aws_iam_instance_profile.profile is not in configuration)
  - resource "aws_iam_instance_profile" "profile" {
      - arn         = "arn:aws:iam::493370826424:instance-profile/webserver" -> null
      - create_date = "2023-08-18T17:08:09Z" -> null
      - id          = "webserver" -> null
      - name        = "webserver" -> null
      - path        = "/" -> null
      - role        = "webserver20230818170808794200000001" -> null
      - tags        = {
          - "created_by_module" = "infrahouse/instance-profile/aws"
        } -> null
      - tags_all    = {
          - "created_by"        = "infrahouse/infrahouse-website-infra"
          - "created_by_module" = "infrahouse/instance-profile/aws"
          - "environment"       = "production"
        } -> null
      - unique_id   = "AIPAXFXZRL24F66FPY5MD" -> null
        # (1 unchanged attribute hidden)
    }

  # module.website.module.webserver_profile.aws_iam_policy.profile will be destroyed
  # (because aws_iam_policy.profile is not in configuration)
  - resource "aws_iam_policy" "profile" {
      - arn              = "arn:aws:iam::493370826424:policy/webserver20230818170808801500000002" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::493370826424:policy/webserver20230818170808801500000002" -> null
      - name             = "webserver20230818170808801500000002" -> null
      - name_prefix      = "webserver" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ec2:Describe*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAXFXZRL24GEOXYPQWS" -> null
      - tags             = {
          - "created_by_module" = "infrahouse/instance-profile/aws"
        } -> null
      - tags_all         = {
          - "created_by"        = "infrahouse/infrahouse-website-infra"
          - "created_by_module" = "infrahouse/instance-profile/aws"
          - "environment"       = "production"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.website.module.webserver_profile.aws_iam_role.profile will be destroyed
  # (because aws_iam_role.profile is not in configuration)
  - resource "aws_iam_role" "profile" {
      - arn                   = "arn:aws:iam::493370826424:role/webserver20230818170808794200000001" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-08-18T17:08:09Z" -> null
      - force_detach_policies = false -> null
      - id                    = "webserver20230818170808794200000001" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::493370826424:policy/webserver20230818170808801500000002",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "webserver20230818170808794200000001" -> null
      - name_prefix           = "webserver" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "created_by_module" = "infrahouse/instance-profile/aws"
        } -> null
      - tags_all              = {
          - "created_by"        = "infrahouse/infrahouse-website-infra"
          - "created_by_module" = "infrahouse/instance-profile/aws"
          - "environment"       = "production"
        } -> null
      - unique_id             = "AROAXFXZRL24BEJUKJ4CW" -> null
        # (2 unchanged attributes hidden)
    }

  # module.website.module.webserver_profile.aws_iam_role_policy_attachment.profile will be destroyed
  # (because aws_iam_role_policy_attachment.profile is not in configuration)
  - resource "aws_iam_role_policy_attachment" "profile" {
      - id         = "webserver20230818170808794200000001-20230818170809342500000004" -> null
      - policy_arn = "arn:aws:iam::493370826424:policy/webserver20230818170808801500000002" -> null
      - role       = "webserver20230818170808794200000001" -> null
    }

Plan: 16 to add, 4 to change, 16 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS90ZXJyYWZvcm0udGZzdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJhZGQiOiAxNiwgImNoYW5nZSI6IDQsICJkZXN0cm95IjogMTZ9fQ==
```
</details>